# [作業目標]

1. 根據給定的 DataFrame 中取出索引為 3, 4, 8 的 animal 和 age 欄位。
2. 請將 dataFrame 所有字串都變成是大寫開頭。

# 作業

In [3]:
# 記得先 Import 正確的套件

'''
Your Code
'''
import numpy as np
import pandas as pd

### 1. 根據給定的 DataFrame 中取出索引為 3, 4, 8 的 animal 和 age 欄位。

In [7]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)
df
df.loc[['d','e','i'],['animal','age']]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [12]:
'''
Your Code
'''

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

### 2. 請將 dataFrame 所有字串都變成是大寫開頭。

In [31]:
df = pd.DataFrame([
    ['tom', 'mark', 'mary'],
    ['bob', 'alice', 'john']
])
df

     0      1     2
0  tom   mark  mary
1  bob  alice  john

In [42]:
'''
Your Code
'''
for i in [0,1]:
    for j in [0,1,2]:
        df.iloc[i,j] = df.iloc[i,j][0].upper()+df.iloc[i,j][1:]
df

     0      1     2
0  Tom   Mark  Mary
1  Bob  Alice  John